{"version": "https://jsonfeed.org/version/1", "title": "AsBuiltReport", "home_page_url": "https://www.asbuiltreport.com/", "feed_url": "https://www.asbuiltreport.com/feed_json_created.json", "description": "Document Your Datacenter With PowerShell", "icon": null, "authors": [{"name": "Tim Carman"}], "language": "en", "items": [{"id": "https://www.asbuiltreport.com/blog/2025/09/05/Multilingual-support/", "url": "https://www.asbuiltreport.com/blog/2025/09/05/Multilingual-support/", "title": "Multilingual support is coming soon to AsBuiltReport", "content_html": "<h1>Multilingual support is coming soon to AsBuiltReport</h1>\n<p>Today I can announce that one of the most requested features for AsBuiltReport is currently in development, with work underway to bring <strong>multilingual support</strong> to the AsBuiltReport framework.</p>\n<p><img alt=\"multilingual\" src=\"../../assets/images/blog/multilingual.jpg\">{ loading=lazy }</p>\n<h2>Key Features in Development</h2>\n<p><strong>🌐 Comprehensive Localization Framework</strong></p>\n<ul>\n<li>\n<p>Implementation of PowerShell's built-in localization capabilities</p>\n</li>\n<li>\n<p>Option for differing UI localization and report localization</p>\n</li>\n</ul>\n<p><strong>📝 Standardised Translation Structure</strong></p>\n<ul>\n<li>\n<p>Standardised folder structures for simple multilingual support adoption</p>\n</li>\n<li>\n<p>Support for resource files containing translated strings for AsBuiltReport core and report modules</p>\n</li>\n<li>\n<p>Automated string extraction and translation</p>\n</li>\n</ul>\n<p><strong>🔧 New Commandline Parameters</strong></p>\n<ul>\n<li>\n<p>Dynamic language selection - language selection is determined by what each AsBuiltReport module supports</p>\n</li>\n<li>\n<p>Support for standard locale codes (en-US, es-ES, fr-FR, de-DE, etc.)</p>\n</li>\n<li>\n<p>Fallback mechanism to ensure reports generate even with incomplete translations</p>\n</li>\n</ul>\n<p><strong>📊 Report Module Integration</strong></p>\n<ul>\n<li>\n<p>Documentation and templates for new and existing report modules to add multilingual support</p>\n</li>\n<li>\n<p>Backward compatibility ensuring existing English-only workflows continue to work</p>\n</li>\n<li>\n<p>Progressive enhancement allowing modules to adopt localization incrementally</p>\n</li>\n</ul>", "image": "https://www.asbuiltreport.com/assets/images/social/blog\\posts\\Multilingual-support-coming-soon.png", "date_published": "2025-09-05T09:00:00+00:00", "authors": [{"name": "Tim Carman"}], "tags": ["Announcements", "Features"]}, {"id": "https://www.asbuiltreport.com/blog/2023/12/05/The-future-of-As-Built-Report/", "url": "https://www.asbuiltreport.com/blog/2023/12/05/The-future-of-As-Built-Report/", "title": "The future of AsBuiltReport", "content_html": "<h1>The future of AsBuiltReport</h1>\n<p>In my <a href=\"../posts/The-history-of-As-Built-Report.md\">previous post</a> I shared how I came to start AsBuiltReport and my reasons for doing so. It's been a few years since its inception and some of you may be asking what does the future hold for the project?</p>\n<p>Before I delve into what may lie ahead, let me take a moment to reflect on the project's progression so far, by extending a sincere thank you to all the <a href=\"../../about/contributors.md\">contributors</a> who have given their time and effort to this project. Whether you have contributed code, reported bugs, provided feedback, written a blog post, or simply participated in discussions, your efforts have not gone unnoticed.</p>", "image": "https://www.asbuiltreport.com/assets/images/social/blog\\posts\\The-future-of-As-Built-Report.png", "date_published": "2023-12-05T09:00:00+00:00", "authors": [{"name": "Tim Carman"}], "tags": ["General"]}, {"id": "https://www.asbuiltreport.com/blog/2023/08/25/the-history-of-asbuiltreport/", "url": "https://www.asbuiltreport.com/blog/2023/08/25/the-history-of-asbuiltreport/", "title": "The history of AsBuiltReport", "content_html": "<h1>The history of AsBuiltReport</h1>\n<h2>The Beginning</h2>\n<p>Back in 2017, having worked on designing and implementing VMware solutions for almost a decade, I became frustrated with having to repeatedly produce as-built documentation for my virtualisation projects.</p>\n<p>At the time, I was designing and implementing 2-3 VMware solutions per month. Each solution would be designed using numerous technology partners, each with their own range of compute, storage, networking and backup technologies.</p>\n<p>My methods to create as-built documentation was arduous, time consuming and error prone. It often involved extracting information using a combination of vendor supplied tools and community developed scripts, and manually transposing information from the vCenter console into a Word document. It was tedious and often resulted in a poorly constructed and formatted document.</p>\n<p>It was also around this time that I realised I had a strong desire to learn PowerShell after seeing many of my co-workers starting to write scripts to automate simple, repeatable tasks. Until this moment, I had never taken the time to completely understand the fundamentals of PowerShell, nor had I worked to develop and expand my knowledge in any form of scripting or automation.</p>\n<p>As a result, I saw this as an opportunity to learn and employ PowerShell automation to ease my pain and frustrations with producing as-built documentation. And so began my mission to create AsBuiltReport!</p>", "image": "https://www.asbuiltreport.com/assets/images/social/blog\\posts\\The-history-of-As-Built-Report.png", "date_published": "2023-08-25T09:00:00+00:00", "authors": [{"name": "Tim Carman"}], "tags": ["General"]}]}